In [39]:
from utils.query_database import QueryDatabase
from frontend.graphs import ViewsTrend

In [40]:
QueryDatabase(f"""
              SELECT geografi, SUM("visningar") 
              AS "Visningar"
              FROM geografi.diagramdata
              GROUP BY geografi
              ORDER BY "Visningar"
              DESC;
              """).df

  Geografi  Visningar
0       SE     1439.0
1       IN       34.0
2       MT       10.0

In [41]:
QueryDatabase(f"""
              SELECT datum, SUM("Visningar")
              AS "Visningar"
              FROM innehall.diagramdata
              WHERE Videotitel = 'Setup dbt (coding)'
              GROUP BY datum
              LIMIT 5;
              """).df

       Datum  Visningar
0 2024-08-13        0.0
1 2024-08-14        0.0
2 2024-08-15        0.0
3 2024-08-16        0.0
4 2024-08-17        0.0

In [42]:
QueryDatabase(f"""
              SELECT videotitel, SUM("visningar")
              AS "Visningar"
              FROM innehall.diagramdata
              GROUP BY videotitel
              ORDER BY "Visningar"
              DESC;
              """).df

                                          Videotitel  Visningar
0                        Setup snowflake and snowsql      101.0
1                                 Setup dbt (coding)       90.0
2                          Setup dlt part 1 (coding)       78.0
3  Setup dlt part 3 - loading csv file into snowf...       74.0
4         Roles and privileges in snowflake (coding)       70.0

In [43]:
QueryDatabase(f"""
              SELECT videotitel, SUM("visningar")
              AS "Visningar"
              FROM innehall.tabelldata
              GROUP BY videotitel
              ORDER BY "Visningar"
              DESC;
              """).df

                                          Videotitel  Visningar
0                                               None     2052.0
1                        Setup snowflake and snowsql      101.0
2                                 Setup dbt (coding)       90.0
3                          Setup dlt part 1 (coding)       78.0
4  Setup dlt part 3 - loading csv file into snowf...       74.0

In [75]:
QueryDatabase(f"""
              SELECT videotitel, "Klickfrekvens för exponeringar (%)"
              AS "click%"
              FROM innehall.tabelldata
              ORDER BY "click%"
              DESC LIMIT 5;
              """).df

                                          Videotitel  click%
0  Kvadreringsregler och konjugatregler härledni...   40.00
1                  Faktorer och nollställen Matte 3C   12.05
2  Extract load API part 3 - dlt to load from job...    5.58
3  Setup dlt part 2 - setup users and roles (coding)    5.02
4                   Chatbot using eden AI API part 1    4.88

In [32]:
QueryDatabase("SELECT * FROM enhetstyp.tabelldata;").df

      Enhetstyp  Visningar  Visningstid (timmar) Genomsnittlig visningslängd
0        Totalt       2052              180.6438                    00:05:16
1         Dator       1694              157.7116                    00:05:35
2  Mobiltelefon        223                8.6123                    00:02:19
3            Tv         68                6.3049                    00:05:33
4    Surfplatta         66                7.9944                    00:07:16